SashaLag/Orazio_on_dsPIC33/myTests/UART_basic_Test/tx_test.X/uart_test.c
#define FCY 16006719UL

#include "uart.h"
#include <string.h>
#include <stdio.h>
#include "delay.h"
#include "p33FJ128MC802.h"
//#include <libpic30.h>


_FOSCSEL(FNOSC_FRC & IESO_OFF); // Internal FRC start-up without PLL,
// no Two Speed Start-up
_FOSC(FCKSM_CSECMD & OSCIOFNC_OFF & POSCMD_XT); // Clock switch enabled,
// Primarly Oscillator XT
_FWDT(FWDTEN_OFF); // Watchdog Timer disabled
//_FPOR(PPWRT_PWR128); // Power-up Timer enabled 128 ms
_FICD(JTAGEN_OFF); // Disable JTAG



struct myUART* uart;
void printString(char* s){
  int l=strlen(s);
  for(int i=0; i<l; ++i, ++s)
    UART_putChar(uart, (uint8_t) *s);
}

int main(void){


  // Configure Oscillator to operate the device at 16 Mhz, Fcy=Fosc/2
  // Fosc= Fin*M/(N1*N2) = 7.37M*139/(8*8)=32.013Mhz for 7.37M input clock
  PLLFBD=137;             // M=139
  CLKDIVbits.PLLPOST=3;		// N1=8
  CLKDIVbits.PLLPRE=6;		// N2=8
  OSCTUN=0;					      // Tune FRC oscillator, if FRC is used

__builtin_write_OSCCONH(0x01);
__builtin_write_OSCCONL(OSCCON | 0x01);
// Wait for Clock switch to occur
while (OSCCONbits.COSC != 0b001);
// Wait for PLL to lock
while(OSCCONbits.LOCK!=1) {};

    TRISB=0;
    LATB = 0x0;

    uart=UART_init("uart_0",115200);
//    uart=UART_init("uart_0", 57600);
  while(1) {
    char tx_message[300];
    char rx_message[300];
    //rx_message[0]=0;
    rx_message[0]=0x41;
    rx_message[1]=0x61;
    rx_message[2]=0;
    int size=2; //0;
    
    while(1){
      delayMs(100); // 625 =~ 1 sec for some reason 
        //uint16_t sec = 1;
        //__delay_ms((uint16_t)1000*sec/(FCY/1000000));
//      sprintf(tx_message, "\nbuffer rx: %d message: ",
//	      UART_rxBufferFull(uart));

//        sprintf(tx_message, "\nbuff: %d",
//	      UART_rxBufferFull(uart));

      sprintf(tx_message, "bufferIsComing\n");  
        
      printString(tx_message);
      printString(rx_message);
      //uint8_t c= UART_getChar(uart);
      //uint8_t c = 0x61;
      //rx_message[size]=c;
      //++size;
      //rx_message[size]=0;
      //if (c=='\n' || c=='\r' || c==0)

	break;
    }
  }
}
